us_mapping = {
    # en2th
    "a": "ฟ", "b": "ิ", "c": "แ", "d": "ก", "e": "ำ", "f": "ด", "g": "เ", "h": "้",
    "i": "ร", "j": "่", "k": "า", "l": "ส", "m": "ท", "n": "ื", "o": "น", "p": "ย",
    "q": "ๆ", "r": "พ", "s": "ห", "t": "ะ", "u": "ี", "v": "อ", "w": "ไ", "x": "ป",
    "y": "ั", "z": "ผ", ";": "ว", "1": "ๅ", "4": "ภ", "5": "ถ", "6": "ุ", "7": "ึ",
    "8": "ค", "9": "ต", "0": "จ", "-": "ข", "=": "ช", "[": "บ", "]": "ล", "{": "ฐ",
    ",": "ม", "|": "ฅ", "'": "ง", "<": "ฒ", ".": "ใ", ">": "ฬ", "/": "ฝ", "?": "ฦ",
    "\\": "ฃ",

    # EN2TH
    "A": "ฤ", "B": "ฺ", "C": "ฉ", "D": "ฏ", "E": "ฎ", "F": "โ", "G": "ฌ", "H": "็",
    "I": "ณ", "J": "๋", "K": "ษ", "L": "ศ", "M": "", "N": "์", "O": "ฯ", "P": "ญ",
    "Q": "๐", "R": "ฑ", "S": "ฆ", "T": "ธ", "U": "๊", "V": "ฮ", "X": ")", "Y": "ํ",
    "Z": "(", ":": "ซ", "^": "ู", "W": '"',

    # th2en
    "ๆ": "q", "ไ": "w", "ำ": "e", "พ": "r", "ะ": "t", "ั": "y", "ี": "u", "ร": "i",
    "น": "o", "ย": "p", "ฟ": "a", "ห": "s", "ก": "d", "ด": "f", "เ": "g", "้": "h",
    "่": "j", "า": "k", "ส": "l", "ผ": "z", "ป": "x", "แ": "c", "อ": "v", "ิ": "b",
    "ื": "n", "ท": "m",

    # TH2EN
    "๐": "Q", "ฎ": "E", "ฑ": "R", "ธ": "T", "ํ": "Y", "๊": "U", "ณ": "I", "ฯ": "O",
    "ญ": "P", "ฤ": "A", "ฆ": "S", "ฏ": "D", "โ": "F", "ฌ": "G", "็": "H", "๋": "J",
    "ษ": "K", "ศ": "L", "(": "Z", ")": "X", "ฉ": "C", "ฮ": "V", "ฺ": "B", "์": "N",
    "?": "M", '"': ".", 'ฦ': "?"
}


def convert_to_thai(english_text):
    thai_text = "".join(us_mapping.get(char, char) for char in english_text)
    return thai_text


while True:
    input_text = input()

    if input_text.lower() in ["/exit", "/quit"]:
        print("til next time 😊")
        break

    output_text = convert_to_thai(input_text)
    print(output_text)